{
  "bio": "Since my first encounter with a computer in 1998, I’ve been passionate about technology. The creative freedom invoked my love of programming and over the past decade of my career in the software development industry has helped me help dozens of businesses produce online solutions, as well as growing teams develop softwares as services. In 2010 I took my first position with Imagine Marketing, where I remotely developed and managed online stores. Then in 2012 I started helping the Wysong team create interactive JavaScript applications. When I moved to Salt Lake City in 2015 I worked with Diib on a predictive analytics service before I took a remote position with WaveOrtho for two years writing software components and PHP FileMaker Server APIs. In 2017, Deseret News offered me a position developing interactives for articles and a CRUD dashboard to manage almanac content. Since then I’ve worked with dozens of local and international businesses to produce professional marketing materials and sophisticated web based technologies. I’ve saved my clients countless hours by programming automation scripts, increased workspace productivity by developing Chrome Extensions, and helped create secure dashboards with tools to manage large realtime databases holding encrypted information.   Please have a look at my resume to learn more about the type of work that I’ve done. I am pleased to have worked with all of these wonderful professionals and will offer the same level of dedication for your project as well.",
  "contact": {
    "phone": "(510) 255-5233",
    "email": "jadeallencook@gmail.com"
  },
  "commands": ["bio", "contact", "resume", "social"],
  "error": "Um, there's nothing to see here...",
  "social": ["github", "instagram", "facebook", "twitter"],
  "resume": [
    {
      "company": "Deseret News & KSL",
      "dates": "October 2017 - February 2019",
      "description": "Worked with a SCRUM team via Slack to manage a Symphony site using GitHub and InVision. Developed React apps embedded with oEmbed and an Angular CRUD interface with Firebase. Created Chrome Extensions and Node automation processes to ease employee workflow."
    }, {
      "company": "WaveOrtho",
      "dates": "September 2015 - May 2017",
      "description": "Remotely collaborated with an Agile team using Slack/GitHub to build JavaScript components and PHP FileMaker Server APIs. Developed a POS using Stripe, base64 image editor, and dozens of other interactive tools."
    }, {
      "company": "Diib",
      "dates": "May 2015 - September 2015",
      "description": "Helped develop a predictive analytics service and user authenticated dashboard encrypted with salted SHA-256 hashing on a LAMP stack. Built onboarding funnels, generated a SEO friendly WordPress blog, and designed wireframes using InVision."
    }, {
      "company": "Peacock Park Design​",
      "dates": "September 2014 - April 2015",
      "description": "Developed an Angular CRUD dashboard for online store using Firebase to handle data/auth. Remotely collaborated with team using Slack to communicate and managed the codebase with GitHub. Used Adobe PhotoShop/Illustrator to design graphics and wireframes."
    }
  ]
}
